{
  "head": {
    "title": "ดึงภาพจากไฟล์ {{FileFormatUp}} ในแอป {{ProgLang}}",
    "description": "ใช้ {{ProdShortName}} เพื่อตรวจจับและดึงภาพจากไฟล์ {{FileFormatUp}} ใน {{ProgLang}} โดยไม่ต้องใช้เครื่องมือเพิ่มเติม."
  },
  "header": {
    "title": "ดึงภาพจาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ค้นหาและดึงภาพที่ฝังอยู่จาก PDF, เอกสาร Word, แผ่น Excel และประเภทไฟล์อื่น ๆ โดยใช้ {{ProdShortName}} ในแอป {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API ของ {{ProdFullName}}",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) 是一个强大的文档解析库，为 {{EnvName}} 开发者提供服务。它สามารถใช้ในการดึงภาพ ข้อความ ลิงก์ และข้อมูลที่มีโครงสร้างจากประเภทไฟล์ยอดนิยมเช่น PDF, DOCX, XLSX, PPTX และอื่น ๆ โดยไม่จำเป็นต้องใช้แอพพลิเคชั่นจากภายนอก."
  },
  "formats": {
    "title": "รูปแบบที่รองรับสำหรับการดึงภาพ",
    "description": "{{ProdShortName}} ช่วยให้การดึงภาพจากเอกสารและรูปแบบภาพต่าง ๆ เป็นไปอย่างแม่นยำ ตรวจสอบรายการด้านล่างเพื่อดูประเภทที่รองรับทั่วไป."
  },
  "examples": {
    "comment_1": "เปิดเอกสารที่มีภาพโดยใช้ {{textParser}}",
    "comment_2": "ดึงภาพที่ฝังอยู่ทั้งหมดจากไฟล์",
    "comment_3": "จัดการกรณีที่ไม่มีภาพ",
    "comment_4": "ประมวลผลหรือบันทึกภาพที่ดึงมา"
  },
  "steps": {
    "title": "ขั้นตอนในการดึงภาพจาก {{FileFormatCap}} ใน {{ProgLang}}",
    "content": {
      "title": "ด้วย [{{ProdShortName}}]({{PlatformLink}}) คุณสามารถดึงภาพจากเอกสาร {{FileFormatUp}} ในโปรเจกต์ {{EnvName}} ของคุณได้ในไม่กี่ขั้นตอน:",
      "step_1": "เริ่มต้น {{textParser}} ด้วยไฟล์ {{FileFormatUp}}.",
      "step_2": "ดึงส่วนภาพจากเอกสาร.",
      "step_3": "ใช้ภาพที่ถูกดึงออกไปตามต้องการในเส้นทางการทำงานของคุณ."
    }
  },
  "more_features": {
    "title": "การดึงข้อมูลเนื้อหาเอกสารอย่างครอบคลุม",
    "description": "{{ProdShortName}} เสนอมากกว่าการดึงภาพ — คุณยังสามารถดึงข้อความดิบ ลิงก์ เมตาดาต้า และเนื้อหาที่มีโครงสร้างสำหรับการสร้างระบบอัตโนมัติขั้นสูง.",
    "image_description": "การดึงภาพและกระบวนการ parsing เอกสาร",
    "feature_1": {
      "title": "ดึงภาพจากหลายรูปแบบ",
      "content": "ดึงภาพที่ฝังอยู่จากหลากหลายรูปแบบไฟล์ รวมถึง DOCX, PDF, PPTX, XLSX และไฟล์ภาพเช่น PNG, JPG และ TIFF."
    },
    "feature_2": {
      "title": "รักษาคุณภาพภาพต้นฉบับ",
      "content": "ภาพถูกรวบรวมด้วยความชัดเจนสูง รักษาความละเอียด รูปแบบ และโปรไฟล์สีเดิม."
    },
    "feature_3": {
      "title": "ตัวเลือกการดึงขั้นสูง",
      "content": "ปรับแต่งการดึงภาพด้วยการกรองตามหน้า รูปแบบ หรือความละเอียด และสนับสนุนเอกสารหลายหน้า."
    },
    "code_1": {
      "title": "วิธีดึงและบันทึกภาพจากเอกสาร PDF",
      "content": "ตัวอย่างนี้แสดงให้เห็นวิธีดึงทรัพย์สินภาพทั้งหมดจากไฟล์ PDF และบันทึกลงในระบบไฟล์ท้องถิ่น.",
      "comment_1": "โหลด PDF โดยใช้คลาส {{textParser}}",
      "comment_2": "ดึงภาพที่ฝังอยู่จากไฟล์",
      "comment_3": "ตั้งค่ารูปแบบเอาต์พุตและตัวเลือกภาพ (เช่น PNG)",
      "comment_4": "เขียนภาพที่ถูกดึงมาไปยังดิสก์"
    }
  }
}