{
  "head": {
    "title": "ดึงภาพจากไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{ProgLang}}",
    "description": "ด้วย {{ProdShortName}} คุณสามารถดึงภาพจากไฟล์ {{FileFormatUp}} ใน {{ProgLang}} ได้อย่างมีประสิทธิภาพ โดยไม่ต้องใช้เครื่องมือของบุคคลที่สาม."
  },
  "header": {
    "title": "ดึงภาพจาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ดึงภาพที่ฝังอยู่จากไฟล์เช่น PDF, Word, Excel และอื่น ๆ โดยใช้ {{ProdShortName}} ในสภาพแวดล้อมการพัฒนา {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "{{ProdFullName}} คืออะไร?",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) เป็น API สำหรับการวิเคราะห์ที่มีฟีเจอร์หลากหลาย ออกแบบมาสำหรับนักพัฒนา {{EnvName}} ช่วยในการดึงภาพ ข้อความ ลิงค์ และองค์ประกอบที่มีโครงสร้างจากไฟล์หลายรูปแบบ รวมถึง DOCX, XLSX, PDF, PNG, JPG และอื่น ๆ โดยไม่ต้องใช้ไลบรารีหรือแอปพลิเคชันภายนอก."
  },
  "formats": {
    "title": "ประเภทไฟล์ที่รองรับสำหรับการดึงภาพ",
    "description": "{{ProdShortName}} รองรับการดึงภาพจากเอกสารและภาพหลากหลายประเภท สำรวจประเภทไฟล์ที่รองรับโดยทั่วไปด้านล่าง."
  },
  "examples": {
    "comment_1": "เริ่มต้นตัว parser และโหลดเอกสารที่มีภาพโดยใช้ {{textParser}}",
    "comment_2": "รวบรวมส่วนประกอบภาพทั้งหมดที่ฝังอยู่ในเอกสาร",
    "comment_3": "ข้ามการประมวลผลหากเอกสารไม่มีภาพ",
    "comment_4": "จัดการกับแต่ละภาพตามที่ต้องการ"
  },
  "steps": {
    "title": "วิธีการดึงภาพจาก {{FileFormatCap}} ใน {{ProgLang}}",
    "content": {
      "title": "ปฏิบัติตามขั้นตอนเหล่านี้เพื่อดึงภาพจากเอกสาร {{FileFormatUp}} โดยใช้ [{{ProdShortName}}]({{PlatformLink}}) ในแอปพลิเคชัน {{EnvName}} ของคุณ:",
      "step_1": "สร้างอ instance ของ {{textParser}} และโหลดไฟล์ {{FileFormatUp}}.",
      "step_2": "ดึงข้อมูลภาพจากเอกสารที่โหลด.",
      "step_3": "ใช้หรือส่งออกภาพที่ดึงมาได้ตามต้องการ."
    }
  },
  "more_features": {
    "title": "ความสามารถในการวิเคราะห์เอกสารเพิ่มเติม",
    "description": "นอกเหนือจากการดึงภาพแล้ว {{ProdShortName}} ยังช่วยให้คุณสามารถดึงเนื้อหาที่เป็นดิบ เช่น ข้อความ ลิงค์ เมตาดาต้า และข้อมูลที่มีโครงสร้างเพื่อการประมวลผลและการวิเคราะห์.",
    "image_description": "ดึงภาพและเนื้อหาจากเอกสาร",
    "feature_1": {
      "title": "ใช้งานได้กับรูปแบบที่หลากหลาย",
      "content": "ดึงภาพจากประเภทเอกสารต่าง ๆ รวมถึง PDF, DOCX, PPTX, XLSX และรูปภาพ เช่น PNG, JPEG และ GIF."
    },
    "feature_2": {
      "title": "รักษาความชัดเจนและความละเอียดของภาพ",
      "content": "ภาพที่ดึงมาได้ทั้งหมดจะคงความละเอียดและประเภทไฟล์เดิมเพื่อให้มีคุณภาพและความสามารถในการใช้งานที่สอดคล้องกัน."
    },
    "feature_3": {
      "title": "ตัวเลือกการกำหนดค่าที่ยืดหยุ่น",
      "content": "ปรับแต่งกระบวนการดึงภาพโดยการกรองภาพตามประเภท ขนาด ดัชนีหน้า หรือรูปแบบไฟล์."
    },
    "code_1": {
      "title": "ดึงและบันทึกภาพจากไฟล์ PDF",
      "content": "ตัวอย่างนี้แสดงวิธีการดึงภาพจากเอกสาร PDF และบันทึกภาพแต่ละภาพลงในอุปกรณ์ของคุณ.",
      "comment_1": "ใช้ {{textParser}} เพื่อเปิดไฟล์ PDF",
      "comment_2": "ดึงภาพจากเนื้อหาเอกสาร",
      "comment_3": "กำหนดค่าพารามิเตอร์ส่งออก เช่น รูปแบบ (เช่น JPEG หรือ PNG)",
      "comment_4": "บันทึกรูปภาพที่ดึงมาได้ลงในไดเรกทอรีท้องถิ่น"
    }
  }
}