{
  "head": {
    "title": "อ่านบาร์โค้ดจากไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{ProgLang}}",
    "description": "ด้วย {{ProdShortName}} คุณสามารถดึงข้อมูลบาร์โค้ดจากเอกสาร {{FileFormatUp}} โดยใช้ {{ProgLang}} โดยไม่ต้องใช้เครื่องมือภายนอกใด ๆ."
  },
  "header": {
    "title": "อ่านบาร์โค้ดจาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ดึงเนื้อหาบาร์โค้ดจากไฟล์ PDF, Word, Excel และภาพ โดยใช้ {{ProdShortName}} ในแอปพลิเคชัน {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้งานฟรี"
  },
  "about": {
    "title": "ภาพรวมของ API {{ProdFullName}}",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) เป็นโซลูชันที่ครอบคลุมสำหรับการวิเคราะห์เอกสารใน {{EnvName}}. มันช่วยให้นักพัฒนาสามารถดึงบาร์โค้ด ข้อความ รูปภาพ และข้อมูลที่มีโครงสร้างจากหลายรูปแบบไฟล์ เช่น PDF, Word, Excel, PowerPoint, และอื่น ๆ โดยไม่จำเป็นต้องใช้ไลบรารีของบุคคลที่สาม."
  },
  "formats": {
    "title": "รูปแบบไฟล์ที่รองรับสำหรับการอ่านบาร์โค้ด",
    "description": "{{ProdShortName}} สามารถอ่านบาร์โค้ดจากหลายประเภทเอกสารและภาพ. ด้านล่างนี้คือบางรูปแบบที่รองรับโดยทั่วไป."
  },
  "examples": {
    "comment_1": "เปิดเอกสารที่มีบาร์โค้ดโดยใช้ {{textParser}}",
    "comment_2": "ตรวจสอบการรองรับบาร์โค้ดสำหรับไฟล์",
    "comment_3": "จัดการกับประเภทไฟล์ที่ไม่รองรับ",
    "comment_4": "ดึงข้อมูลบาร์โค้ดและใช้งาน"
  },
  "steps": {
    "title": "วิธีอ่านบาร์โค้ดจาก {{FileFormatCap}} ใน {{ProgLang}}",
    "content": {
      "title": "ด้วย [{{ProdShortName}}]({{PlatformLink}}), นักพัฒนาที่ {{EnvName}} สามารถดึงบาร์โค้ดจากเอกสาร {{FileFormatUp}} ได้ภายในไม่กี่ขั้นตอน:",
      "step_1": "โหลดเอกสาร {{FileFormatUp}} โดยใช้ {{textParser}}.",
      "step_2": "ตรวจสอบว่าเอกสารรองรับการดึงบาร์โค้ด.",
      "step_3": "ใช้ API เพื่อดึงข้อมูลบาร์โค้ด.",
      "step_4": "วนลูปผ่านผลลัพธ์บาร์โค้ดและนำไปใช้ตามต้องการ."
    }
  },
  "more_features": {
    "title": "ความสามารถในการแยกข้อมูลเพิ่มเติม",
    "description": "{{ProdShortName}} ไม่เพียงแต่แยกบาร์โค้ด—มันยังช่วยคุณดึงข้อความธรรมดา รูปภาพ และองค์ประกอบที่มีโครงสร้างเพื่อสนับสนุนการทำงานที่ขับเคลื่อนด้วยข้อมูล.",
    "image_description": "คุณลักษณะการดึงบาร์โค้ดและข้อมูล",
    "feature_1": {
      "title": "รองรับรูปแบบบาร์โค้ดที่หลากหลาย",
      "content": "ตรวจจับรูปแบบบาร์โค้ดมาตรฐาน ได้แก่ QR Code, Code 39, Data Matrix, EAN, Aztec, และอื่น ๆ."
    },
    "feature_2": {
      "title": "อ่านบาร์โค้ดจากหลายแหล่ง",
      "content": "ดึงข้อมูลบาร์โค้ดจากเอกสาร Office, PDF, และไฟล์ภาพ เช่น PNG, JPG, และ BMP."
    },
    "feature_3": {
      "title": "การตั้งค่าการอ่านบาร์โค้ดแบบกำหนดเอง",
      "content": "ปรับแต่งการดึงบาร์โค้ดด้วยตัวเลือกในการกำหนดเป้าหมายพื้นที่เฉพาะและไฟล์หลายหน้า."
    },
    "code_1": {
      "title": "ตัวอย่าง: ดึงบาร์โค้ดจาก PDF พร้อมตัวเลือก",
      "content": "ตัวอย่างนี้แสดงให้เห็นถึงการดึงบาร์โค้ดจากเอกสาร PDF โดยใช้การตั้งค่าที่กำหนดเอง.",
      "comment_1": "เริ่มต้นตัว解析ด้วยเอกสาร PDF",
      "comment_2": "ตรวจสอบว่าเอกสารรองรับการอ่านบาร์โค้ด",
      "comment_3": "ใช้การกรองด้วยตัวเลือกบาร์โค้ด",
      "comment_4": "ดึงบาร์โค้ดโดยใช้ตัว解析",
      "comment_5": "จัดการผลลัพธ์บาร์โค้ดแต่ละรายการ"
    }
  }
}