{
  "head": {
    "title": "ดึงข้อมูลบาร์โค้ดจากไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{ProgLang}}",
    "description": "ใช้ {{ProdShortName}} ในการตรวจจับและดึงข้อมูลบาร์โค้ดจากไฟล์ {{FileFormatUp}} ใน {{ProgLang}} โดยไม่ต้องใช้ซอฟต์แวร์เพิ่มเติม."
  },
  "header": {
    "title": "ดึงข้อมูลบาร์โค้ดจาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ตรวจจับและดึงข้อมูลบาร์โค้ดจากไฟล์ PDF, Word, Excel และไฟล์ภาพโดยใช้ {{ProdShortName}} ในแอปพลิเคชัน {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดรุ่นทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API ของ {{ProdFullName}}",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) เป็น API สำหรับการแยกเอกสารที่มีประสิทธิภาพสำหรับนักพัฒนา {{EnvName}} ซึ่งช่วยให้สามารถดึงข้อความ, รูปภาพ, เนื้อหาที่มีโครงสร้าง, และบาร์โค้ดจากรูปแบบไฟล์ต่าง ๆ รวมถึง PDF, Word, Excel, PowerPoint และอื่น ๆ — ทั้งหมดนี้สามารถทำได้โดยไม่ต้องอิงเครื่องมือภายนอก."
  },
  "formats": {
    "title": "รูปแบบที่รองรับสำหรับการดึงข้อมูลบาร์โค้ด",
    "description": "{{ProdShortName}} รองรับการตรวจจับบาร์โค้ดในรูปแบบเอกสารและภาพที่หลากหลาย ดูด้านล่างสำหรับประเภทไฟล์ที่รองรับโดยทั่วไป."
  },
  "examples": {
    "comment_1": "โหลดเอกสารที่มีบาร์โค้ดโดยใช้คลาส {{textParser}}",
    "comment_2": "ตรวจสอบว่าไฟล์สนับสนุนการดึงข้อมูลบาร์โค้ด",
    "comment_3": "ไม่สามารถดึงข้อมูลบาร์โค้ดได้",
    "comment_4": "ดึงและประมวลผลบาร์โค้ดที่ถูกดึงข้อมูล"
  },
  "steps": {
    "title": "ขั้นตอนในการดึงข้อมูลบาร์โค้ดจาก {{FileFormatCap}} ใน {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้คุณสามารถดึงข้อมูลบาร์โค้ดจากไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{EnvName}} โดยทำตามขั้นตอนง่าย ๆ เหล่านี้:",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} โดยใช้อินสแตนซ์ {{textParser}}.",
      "step_2": "ตรวจสอบว่าเอกสารสนับสนุนการดึงข้อมูลบาร์โค้ด.",
      "step_3": "ดึงรายชื่อบาร์โค้ดจากเอกสาร.",
      "step_4": "วนรอบผ่านผลลัพธ์และใช้ค่าบาร์โค้ดที่ถูกดึงข้อมูล."
    }
  },
  "more_features": {
    "title": "คุณสมบัติการแยกเอกสารขั้นสูง",
    "description": "นอกเหนือจากการดึงข้อมูลบาร์โค้ดแล้ว {{ProdShortName}} ยังช่วยให้คุณสามารถดึงข้อความธรรมดา, รูปภาพ และข้อมูลที่มีโครงสร้างเพื่อสนับสนุนการทำงานอัตโนมัติและกระบวนการจัดการข้อมูลที่ซับซ้อน.",
    "image_description": "การรู้จำบาร์โค้ดและการแยกเอกสาร",
    "feature_1": {
      "title": "สนับสนุนรูปแบบบาร์โค้ดหลายรูปแบบ",
      "content": "รับรู้ประเภทบาร์โค้ดที่พบมากรวมถึง QR Code, Code 128, Data Matrix, EAN, Aztec และอื่น ๆ."
    },
    "feature_2": {
      "title": "ดึงบาร์โค้ดจากเอกสารและภาพ",
      "content": "อ่านบาร์โค้ดจากเอกสาร PDF, Word, Excel และรูปแบบภาพเช่น JPEG, PNG และ BMP."
    },
    "feature_3": {
      "title": "การตั้งค่าการดึงข้อมูลที่ปรับแต่งได้",
      "content": "กำหนดตัวเลือกการตรวจจับเช่น พื้นที่การสแกนและการประมวลผลเอกสารหลายหน้า."
    },
    "code_1": {
      "title": "วิธีดึงข้อมูลบาร์โค้ดจาก PDF โดยใช้ตัวเลือกบาร์โค้ด",
      "content": "ตัวอย่างนี้แสดงวิธีการดึงข้อมูลบาร์โค้ดจากไฟล์ PDF โดยใช้ตัวเลือกการดึงข้อมูลบาร์โค้ดที่เฉพาะเจาะจง.",
      "comment_1": "โหลดไฟล์ PDF ด้วยคลาส {{textParser}}",
      "comment_2": "ยืนยันว่าการดึงข้อมูลบาร์โค้ดได้รับการสนับสนุน",
      "comment_3": "ใช้ตัวเลือกบาร์โค้ดเพื่อกรองผลลัพธ์",
      "comment_4": "ดึงข้อมูลบาร์โค้ดจากเอกสาร",
      "comment_5": "ประมวลผลรายชื่อบาร์โค้ดที่ถูกดึงข้อมูล"
    }
  }
}