{
  "head": {
    "title": "ดึงตารางจากเอกสาร {{FileFormatUp}} ในแอปพลิเคชัน {{ProgLang}}",
    "description": "ดึงข้อมูลตารางที่มีโครงสร้างจากไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{ProgLang}} ด้วย {{ProdShortName}}—ไม่ต้องใช้เครื่องมือภายนอก."
  },
  "header": {
    "title": "ดึงข้อมูลตารางจาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ตรวจจับและดึงตารางจากรูปแบบต่างๆ เช่น PDF, DOCX และ XLSX อย่างไร้รอยต่อด้วย {{ProdShortName}} ในการทำงานของ {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดรุ่นทดลองใช้ฟรี"
  },
  "about": {
    "title": "แนะนำ API ของ {{ProdFullName}}",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) คือ API การดึงข้อมูลที่มีฟีเจอร์ครบถ้วนสำหรับแพลตฟอร์ม {{EnvName}} ช่วยให้นักพัฒนาสามารถวิเคราะห์ตาราง ข้อความ กราฟิก ลิงก์ และข้อมูลที่มีโครงสร้างจากไฟล์ PDF เอกสาร Word แผ่น Excel งานนำเสนอ PowerPoint และอื่นๆ ได้อย่างแม่นยำ—โดยไม่จำเป็นต้องใช้ปลั๊กอินของบุคคลที่สาม."
  },
  "formats": {
    "title": "ประเภทเอกสารที่รองรับสำหรับการดึงตาราง",
    "description": "{{ProdShortName}} ให้การตรวจจับตารางที่เชื่อถือได้จากหลายประเภทไฟล์ นี่คือรายการรูปแบบเอกสารที่ได้รับการสนับสนุนอย่างกว้างขวางสำหรับการดึงตาราง."
  },
  "examples": {
    "comment_1": "โหลดเอกสารที่มี {{textParser}} ซึ่งรวมถึงองค์ประกอบตาราง",
    "comment_2": "ตรวจสอบว่าเอกสารประเภทนั้นอนุญาตให้ตรวจจับตาราง",
    "comment_3": "เพิ่มตรรกะสำหรับไฟล์ที่ไม่รองรับตาราง",
    "comment_4": "กำหนดกฎสำหรับการตีความโครงสร้างตาราง",
    "comment_5": "ตั้งค่าพารามิเตอร์สำหรับการดึงตาราง",
    "comment_6": "ดำเนินการดึงตารางจากเอกสารที่โหลดแล้ว",
    "comment_7": "ประมวลผลแต่ละตารางที่ดึงออกมาจากผลลัพธ์"
  },
  "steps": {
    "title": "วิธีการดึงตารางจาก {{FileFormatCap}} ใน {{ProgLang}}",
    "content": {
      "title": "ในการวิเคราะห์ตารางจากเอกสาร {{FileFormatUp}} โดยใช้ [{{ProdShortName}}]({{PlatformLink}}) ให้ปฏิบัติตามขั้นตอนเหล่านี้ในสภาพแวดล้อม {{EnvName}} ของคุณ:",
      "step_1": "สร้างอินสแตนซ์ของ {{textParser}} และโหลดไฟล์ {{FileFormatUp}} ที่ต้องการ.",
      "step_2": "ตรวจสอบว่าไฟล์นั้นรองรับการดึงตารางที่มีโครงสร้าง.",
      "step_3": "ใช้ API เพื่อตรวจจับองค์ประกอบตารางจากเอกสาร.",
      "step_4": "ใช้ข้อมูลที่ดึงมาในการวิเคราะห์ การทำรายงาน หรือระบบอัตโนมัติ."
    }
  },
  "more_features": {
    "title": "เครื่องมือการดึงข้อมูลขั้นสูง",
    "description": "นอกเหนือจากการอ่านตารางแล้ว {{ProdShortName}} ยังรองรับการจับข้อมูลพื้นฐาน องค์ประกอบภาพ เมตาดาต้าแบบฝัง และวัตถุที่มีโครงสร้างเพื่อเสริมสร้างงานประมวลผลเอกสาร.",
    "image_description": "การดึงเนื้อหาที่มีโครงสร้างและข้อมูลตาราง",
    "feature_1": {
      "title": "การวิเคราะห์ตารางอย่างแม่นยำในหลายรูปแบบ",
      "content": "รองรับการดึงตารางจากประเภทเอกสารมาตรฐาน เช่น PDF, Word, Excel และ HTML อย่างมีความแม่นยำสูง."
    },
    "feature_2": {
      "title": "อ่านโครงสร้างตารางจากแหล่งที่หลากหลาย",
      "content": "ดึงข้อมูลตารางจากแผ่นงาน เอกสาร และรายงาน ในขณะที่ยังรักษาโครงสร้างและการจัดตำแหน่ง."
    },
    "feature_3": {
      "title": "การตั้งค่าการดึงตารางที่ปรับแต่งได้",
      "content": "ควบคุมการตรวจจับเลย์เอาต์ จัดการส่วนหัวและส่วนท้าย และปรับแต่งการดึงข้อมูลด้วยตัวเลือกการกำหนดค่าที่ยืดหยุ่น."
    },
    "code_1": {
      "title": "ตัวอย่าง: ดึงตารางจากเอกสาร Excel",
      "content": "ตัวอย่างนี้แสดงวิธีการดึงและวนลูปผ่านเนื้อหาตารางในไฟล์ Excel (XLSX) โดยใช้ {{ProdShortName}}.",
      "comment_1": "เริ่มต้น {{textParser}} ด้วยไฟล์ Excel",
      "comment_2": "ออกจากระบบหากการดึงข้อมูลตารางไม่รองรับสำหรับเอกสารนี้",
      "comment_3": "ใช้กฎเพื่อค้นหาเลย์เอาต์ตาราง",
      "comment_4": "กำหนดค่าการตั้งสำหรับการดึงตาราง",
      "comment_5": "เรียกใช้กระบวนการดึงข้อมูล",
      "comment_6": "วนลูปผ่านโครงสร้างตารางที่วิเคราะห์ทั้งหมด",
      "comment_7": "วนซ้ำแต่ละแถวภายในตาราง",
      "comment_8": "ประมวลผลแต่ละเซลล์ในแถวปัจจุบัน",
      "comment_9": "เข้าถึงและอ่านเนื้อหาของเซลล์ปัจจุบัน",
      "comment_10": "แสดงค่าข้อความของเซลล์ตารางแต่ละเซลล์"
    }
  }
}