{
  "head": {
    "title": "ดึงตารางจากไฟล์ {{FileFormatUp}} ในแอพ {{ProgLang}}",
    "description": "ใช้ {{ProdShortName}} เพื่อตรวจจับและดึงข้อมูลตารางที่มีโครงสร้างจากไฟล์ {{FileFormatUp}} ในแอพ {{ProgLang}} โดยไม่ต้องพึ่งพาไลบรารีภายนอก."
  },
  "header": {
    "title": "ดึงตารางจาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ระบุและดึงโครงสร้างตารางจาก PDF, Word, Excel และรูปแบบไฟล์อื่น ๆ อย่างรวดเร็วโดยใช้ {{ProdShortName}} ในโปรเจกต์ {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API {{ProdFullName}}",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) เป็น API ที่ครอบคลุมสำหรับการแยกเนื้อหาในเอกสาร ซึ่งสร้างขึ้นสำหรับนักพัฒนา {{EnvName}} ช่วยให้สามารถดึงข้อมูลที่ถูกต้องของข้อความ, ตาราง, รูปภาพ, ลิงก์ และองค์ประกอบที่มีโครงสร้างอื่น ๆ จากรูปแบบต่าง ๆ เช่น PDF, DOCX, XLSX, PPTX และอื่น ๆ โดยไม่ต้องใช้ซอฟต์แวร์ของบุคคลที่สาม."
  },
  "formats": {
    "title": "รูปแบบที่รองรับสำหรับการดึงตาราง",
    "description": "{{ProdShortName}} สามารถดึงข้อมูลตารางจากเอกสารหลายประเภทได้ ด้านล่างคือรูปแบบที่ใช้บ่อยที่สุดสำหรับการวิเคราะห์ตารางที่มีโครงสร้าง."
  },
  "examples": {
    "comment_1": "เปิดเอกสารที่มีข้อมูลตารางโดยใช้ {{textParser}}",
    "comment_2": "ตรวจสอบว่ารูปแบบสนับสนุนการจดจำตารางหรือไม่",
    "comment_3": "จัดการกับเอกสารที่ไม่สนับสนุนการวิเคราะห์ตาราง",
    "comment_4": "กำหนดว่าโครงสร้างตารางจะถูกระบุอย่างไร",
    "comment_5": "กำหนดพารามิเตอร์การดึงข้อมูลสำหรับข้อมูลตาราง",
    "comment_6": "ดึงตารางจากเนื้อหาไฟล์",
    "comment_7": "วนซ้ำผ่านแต่ละตารางที่ตรวจพบ"
  },
  "steps": {
    "title": "ขั้นตอนในการดึงตารางจาก {{FileFormatCap}} ใน {{ProgLang}}",
    "content": {
      "title": "ทำตามคำแนะนำเหล่านี้เพื่อลดการดึงตารางจากไฟล์ {{FileFormatUp}} โดยใช้ [{{ProdShortName}}]({{PlatformLink}}) ภายในสภาพแวดล้อม {{EnvName}} ของคุณ:",
      "step_1": "สร้างอินสแตนซ์ของ {{textParser}} และโหลดเอกสาร {{FileFormatUp}} ของคุณ.",
      "step_2": "ตรวจสอบว่าการดึงตารางถูกสนับสนุนสำหรับรูปแบบข้อมูลนำเข้า.",
      "step_3": "ดึงเนื้อหาตารางจากไฟล์.",
      "step_4": "ใช้ข้อมูลตารางที่มีโครงสร้างสำหรับการรายงาน การทำงานอัตโนมัติ หรือการวิเคราะห์."
    }
  },
  "more_features": {
    "title": "ความสามารถในการดึงข้อมูลที่ทรงพลัง",
    "description": "นอกจากการวิเคราะห์ตารางแล้ว {{ProdShortName}} ยังสามารถดึงเนื้อหาที่หลากหลาย เช่น บล็อกข้อความ รูปภาพ เมตาดาต้า และข้อมูลที่มีโครงสร้างอื่น ๆ เพื่อตอบสนองความต้องการในการทำงานอัตโนมัติของเอกสาร.",
    "image_description": "การจดจำตารางและการดึงเนื้อหา",
    "feature_1": {
      "title": "การตรวจจับตารางหลายรูปแบบที่แม่นยำ",
      "content": "ดึงข้อมูลตารางจาก DOCX, XLSX, PDF, HTML และรูปแบบที่คล้ายกันด้วยความแม่นยำสูง."
    },
    "feature_2": {
      "title": "วิเคราะห์โครงสร้างตารางจากไฟล์",
      "content": "ดึงข้อมูลตารางจากเอกสารและสเปรดชีตได้อย่างมีประสิทธิภาพโดยไม่สูญเสียรูปแบบ."
    },
    "feature_3": {
      "title": "การกำหนดค่าการดึงตารางที่ยืดหยุ่น",
      "content": "ปรับแต่งการตรวจจับลักษณะ การจัดเรียงคอลัมน์ และตัวเลือกหัว/ท้ายเพื่อควบคุมผลลัพธ์อย่างแม่นยำ."
    },
    "code_1": {
      "title": "วิธีการดึงตารางจากสเปรดชีต Excel",
      "content": "ตัวอย่างโค้ดนี้แสดงวิธีการอ่านและวนซ้ำผ่านข้อมูลตารางในไฟล์ XLSX โดยใช้ {{ProdShortName}}.",
      "comment_1": "เปิดไฟล์ Excel โดยใช้ API {{textParser}}",
      "comment_2": "ออกจากงานถ้าไม่สามารถดึงตารางจากไฟล์ได้",
      "comment_3": "ใช้กฎจัดรูปแบบเพื่อค้นหาข้อมูลตาราง",
      "comment_4": "กำหนดพารามิเตอร์การดึงข้อมูลสำหรับตาราง",
      "comment_5": "ดำเนินการดึงข้อมูลตาราง",
      "comment_6": "ตรวจสอบแต่ละโครงสร้างตารางที่ตรวจจับได้",
      "comment_7": "วนผ่านแต่ละแถวในตาราง",
      "comment_8": "วนซ้ำผ่านเซลล์ในแต่ละแถว",
      "comment_9": "เข้าถึงเซลล์ตารางปัจจุบัน",
      "comment_10": "แสดงเนื้อหาข้อความในแต่ละเซลล์"
    }
  }
}