{
  "head": {
    "title": "ดึงข้อความจากไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{ProgLang}}",
    "description": "ใช้ {{ProdShortName}} เพื่อดึงเนื้อหาข้อความที่ไม่มีโครงสร้างหรือมีโครงสร้างจากเอกสาร {{FileFormatUp}} ใน {{ProgLang}} โดยไม่ต้องพึ่งพาส่วนเสริมภายนอก"
  },
  "header": {
    "title": "ดึงข้อความจาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ดึงข้อความที่อ่านได้หรือมีโครงสร้างจากไฟล์เช่น PDF, Word, Excel และอื่น ๆ โดยใช้ {{ProdShortName}} ในโครงการพัฒนา {{EnvNameShort}} ของคุณ",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดรุ่นทดลองใช้ฟรี"
  },
  "about": {
    "title": "แนะนำ API {{ProdFullName}}",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) เป็นโปรแกรมจัดการเอกสารที่มีความสามารถและขยายตัวได้ ออกแบบมาสำหรับนักพัฒนาที่ใช้ {{EnvName}} โดยมีฟังก์ชันการทำงานที่ช่วยให้สามารถดึงข้อความ ตาราง รูปภาพ และส่วนประกอบที่มีโครงสร้างจากฟอร์แมตต่าง ๆ เช่น PDF, DOCX, XLSX, PPTX และอื่น ๆ โดยไม่ต้องพึ่งพาเครื่องมือภายนอก"
  },
  "formats": {
    "title": "ประเภทไฟล์ที่รองรับสำหรับการดึงข้อความ",
    "description": "{{ProdShortName}} สามารถดึงเนื้อหาข้อความจากรูปแบบไฟล์และรูปภาพต่าง ๆ ได้ ด้านล่างนี้คือประเภทที่ใช้งานบ่อยที่สุดที่รองรับ"
  },
  "examples": {
    "comment_1": "เริ่มต้น {{textParser}} ด้วยเอกสารของคุณ",
    "comment_2": "อ่านและดึงข้อมูลข้อความทั้งหมด",
    "comment_3": "ส่งคืน null หากไม่มีเนื้อหาข้อความ",
    "comment_4": "รวมข้อความที่ดึงเข้าไปในกระบวนการทำงานของคุณ",
    "comment_5": "ข้ามรูปแบบการดึงข้อความที่ไม่รองรับ"
  },
  "steps": {
    "title": "วิธีการดึงข้อความจาก {{FileFormatCap}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "ทำตามขั้นตอนด้านล่างเพื่อดึงข้อความจากไฟล์ {{FileFormatUp}} โดยใช้ [{{ProdShortName}}]({{PlatformLink}}) ภายในโครงการ {{EnvName}} ของคุณ:",
      "step_1": "โหลดเอกสาร {{FileFormatUp}} โดยใช้คลาส {{textParser}}",
      "step_2": "ดำเนินการดึงข้อความจากเนื้อหาไฟล์",
      "step_3": "ตรวจสอบว่าข้อความถูกรับคืนอย่างถูกต้องหรือไม่",
      "step_4": "ใช้ข้อมูลข้อความในระบบค้นหา การวิเคราะห์ หรือระบบอัตโนมัติ"
    }
  },
  "more_features": {
    "title": "ฟังก์ชันการดึงข้อความที่หลากหลาย",
    "description": "{{ProdShortName}} ไม่เพียงแต่ดึงข้อความแบบธรรมดา - ยังรองรับการดึงรูปภาพ เมตาและข้อมูลที่มีโครงสร้างเพื่อเสริมการทำงานกับเนื้อหา",
    "image_description": "ดึงและจัดระเบียบเนื้อหาข้อความจากเอกสาร",
    "feature_1": {
      "title": "ทำงานกับรูปแบบเอกสารมากมาย",
      "content": "จับข้อความทั้งที่เป็นดิบและมีโครงสร้างจาก DOCX, XLSX, PPTX, PDF, HTML และรูปแบบต่าง ๆ"
    },
    "feature_2": {
      "title": "ดึงข้อความจากเนื้อหาภาพและข้อความ",
      "content": "วิเคราะห์ข้อความจากเอกสารที่สแกน สไลด์ สเปรดชีต และประเภทไฟล์อื่น ๆ ในขณะรักษาโครงสร้างที่เข้าใจได้"
    },
    "feature_3": {
      "title": "ควบคุมรายละเอียดการดึงข้อมูล",
      "content": "กำหนดขอบเขตหน้าที่ต้องการ โซนเลย์เอาต์ และพารามิเตอร์ความแม่นยำสำหรับการวิเคราะห์ข้อความที่ละเอียด"
    },
    "code_1": {
      "title": "ตัวอย่าง: การดึงเนื้อหาข้อความจากเอกสาร PPTX",
      "content": "ตัวอย่างนี้แสดงถึงการดึงบล็อกข้อความพร้อมกับพิกัดเชิงพื้นที่จากการนำเสนอ PowerPoint โดยใช้ {{ProdShortName}}",
      "comment_1": "โหลดไฟล์ PPTX ของคุณด้วย API {{textParser}}",
      "comment_2": "รับเขตข้อความที่เป็นรูปทรงสี่เหลี่ยมทั้งหมด",
      "comment_3": "ออกจากโปรแกรมหากฟังก์ชันนี้ไม่รองรับ",
      "comment_4": "วนลูปผ่านพื้นที่ข้อความตามหน้า",
      "comment_5": "ประมวลผลบล็อกข้อความแต่ละบล็อกพร้อมหมายเลขหน้าและสี่เหลี่ยมพิมพ์"
    }
  }
}