{
  "head": {
    "title": "{{FileFormatUp}} ไฟล์ข้อมูลการแยกวิเคราะห์ในแอป {{ProgLang}}",
    "description": "ใช้ {{ProdShortName}} เพื่อดึงข้อความ รูปภาพ ตาราง และข้อมูลอื่น ๆ จากไฟล์ {{FileFormatUp}} ในแอป {{ProgLang}} โดยไม่พึ่งพาเครื่องมือของบุคคลที่สาม."
  },
  "header": {
    "title": "แยกวิเคราะห์เอกสาร {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ดึงข้อมูล ข้อมูลเมตา ตาราง และรูปภาพจากไฟล์ PDF Word Excel และไฟล์รูปภาพอย่างมีประสิทธิภาพโดยใช้ {{ProdShortName}} ในโปรเจกต์ {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API {{ProdFullName}}",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) เป็น API การแยกวิเคราะห์เอกสารที่มีฟีเจอร์ครบครันที่ออกแบบมาสำหรับนักพัฒนา {{EnvName}} สามารถดึงข้อมูลข้อความแบบธรรมดาและมีโครงสร้าง ข้อมูลเมตา รูปภาพ ตาราง และบาร์โค้ดจากรูปแบบที่นิยม เช่น PDF, DOCX, XLSX, PPTX และอื่น ๆ — ทั้งหมดนี้โดยไม่ต้องพึ่งพาซอฟต์แวร์เพิ่มเติม."
  },
  "formats": {
    "title": "รูปแบบที่รองรับสำหรับการดึงข้อมูล",
    "description": "{{ProdShortName}} รองรับการแยกวิเคราะห์ในกลุ่มที่หลากหลายของเอกสารและรูปแบบภาพ สำรวจประเภทไฟล์ที่รองรับที่ใช้กันทั่วไปในกระบวนการดึงข้อมูล."
  },
  "examples": {
    "comment_1": "โหลดเอกสารของคุณเข้าสู่ {{textParser}}",
    "comment_2": "ดึงข้อมูลข้อความทั้งหมดจากไฟล์",
    "comment_3": "หากข้อความไม่สามารถดึงได้ ผลลัพธ์จะเป็น null",
    "comment_4": "ใช้ข้อความที่ดึงได้ในแอปของคุณ",
    "comment_5": "การดึงข้อมูลข้อความไม่รองรับสำหรับรูปแบบนี้"
  },
  "steps": {
    "title": "ขั้นตอนในการดึงข้อมูลจาก {{FileFormatCap}} ใน {{ProgLang}}",
    "content": {
      "title": "ปฏิบัติตามขั้นตอนเหล่านี้เพื่อแยกเนื้อหาจากเอกสาร {{FileFormatUp}} ในแอป {{EnvName}} ของคุณโดยใช้ [{{ProdShortName}}]({{PlatformLink}}):",
      "step_1": "โหลดเอกสาร {{FileFormatUp}} โดยใช้อินสแตนซ์ของ {{textParser}}.",
      "step_2": "ดึงเนื้อหาที่ต้องการเช่น ข้อความ ตาราง หรือข้อมูลเมตา.",
      "step_3": "ตรวจสอบว่าข้อมูลที่ดึงมาใช้ได้.",
      "step_4": "ใช้ผลลัพธ์ที่แยกวิเคราะห์ในกระบวนการต่อไป ระบบอัตโนมัติ หรือระบบธุรกิจของคุณ."
    }
  },
  "more_features": {
    "title": "ความสามารถในการแยกวิเคราะห์เอกสารที่ครอบคลุม",
    "description": "{{ProdShortName}} รองรับมากกว่าเพียงการอ่านข้อความ — ยังสนับสนุนการดึงข้อมูลบาร์โค้ด การแยกรูปภาพ การเข้าถึงข้อมูลเมตา และการประมวลผลข้อมูลแบบมีโครงสร้างเพื่อการทำงานอัตโนมัติและการวิเคราะห์ข้อมูลที่ทันสมัย.",
    "image_description": "ความสามารถในการดึงข้อมูลและการแยกวิเคราะห์เอกสาร",
    "feature_1": {
      "title": "รองรับประเภทเนื้อหาของไฟล์ที่หลากหลาย",
      "content": "ดึงข้อมูลรวมถึงข้อความ รูปภาพ ตาราง และฟิลด์จากรูปแบบเอกสารเช่น PDF Word Excel HTML และอื่น ๆ."
    },
    "feature_2": {
      "title": "ทำงานกับไฟล์สแกนและดิจิทัล",
      "content": "แยกข้อมูลจากเอกสารที่ถูกสแกนและไฟล์ที่สร้างขึ้นโดยดิจิทัล มีการสนับสนุน OCR และการแยกข้อมูลที่รู้จักรูปแบบ."
    },
    "feature_3": {
      "title": "พารามิเตอร์การแยกวิเคราะห์ที่ปรับแต่งได้",
      "content": "ปรับตรรกะการแยกวิเคราะห์ด้วยตัวเลือกที่ยืดหยุ่นเช่น การเลือกช่วงหน้า การกำหนดเป้าหมายพื้นที่ และแม่แบบการตรวจจับฟิลด์."
    },
    "code_1": {
      "title": "วิธีการแยกวิเคราะห์ PDF โดยใช้แม่แบบ",
      "content": "ตัวอย่างนี้แสดงวิธีการดึงข้อมูลที่มีโครงสร้างจาก PDF โดยใช้แม่แบบการแยกวิเคราะห์ที่กำหนดไว้ล่วงหน้าด้วย {{ProdShortName}}.",
      "comment_1": "โหลดไฟล์ PDF ด้วยคลาส {{textParser}}",
      "comment_2": "แยกวิเคราะห์เอกสารตามแม่แบบ",
      "comment_3": "ตรวจสอบว่าการดึงข้อมูลฟอร์มได้รับการสนับสนุนหรือไม่",
      "comment_4": "ประมวลผลฟิลด์ที่ได้รับ",
      "comment_5": "สร้างพารามิเตอร์ตรวจจับสำหรับตาราง 'รายละเอียด'"
    }
  }
}