{
  "head": {
    "title": "{{ProgLang}} แอพพลิเคชันสามารถดึงข้อมูลจากไฟล์ {{FileFormatUp}} ได้",
    "description": "ใช้ {{ProdShortName}} ในการแยกและดึงข้อมูลที่มีโครงสร้าง ข้อความ ตาราง และรูปภาพจากไฟล์ {{FileFormatUp}} ใน {{ProgLang}} โดยไม่จำเป็นต้องใช้เครื่องมือภายนอก."
  },
  "header": {
    "title": "ดึงข้อมูลจากเอกสาร {{FileFormatUp}} ใน {{ProgLang}}",
    "description": "ดึงเนื้อหาที่มีโครงสร้าง เช่น ข้อความ ข้อมูลเมตา ตาราง และกราฟิกจากเอกสาร PDF, Word, Excel และเอกสารที่มีพื้นฐานจากภาพโดยใช้ {{ProdShortName}} ในแอพ {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดรุ่นทดลองใช้ฟรี"
  },
  "about": {
    "title": "{{ProdFullName}} คืออะไร?",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) เป็น API ที่แข็งแกร่งสร้างขึ้นสำหรับนักพัฒนา {{EnvName}} โดยนำเสนอฟังก์ชันการแยกเอกสารขั้นสูง ช่วยให้คุณสามารถดึงและประมวลผลข้อมูลข้อความ รูปภาพ ตาราง ฟิลด์ที่มีโครงสร้าง และบาร์โค้ดจากหลายรูปแบบ เช่น PDF, DOCX, XLSX, PPTX และอื่น ๆ ทั้งหมดนี้โดยไม่ต้องติดตั้งไลบรารีเพิ่มเติม."
  },
  "formats": {
    "title": "ประเภทไฟล์ที่รองรับสำหรับการดึงข้อมูล",
    "description": "{{ProdShortName}} รองรับประเภทไฟล์เอกสารและรูปภาพที่หลากหลาย ทำให้ง่ายต่อการดึงข้อมูลจากรูปแบบที่ใช้กันทั่วไปในสถานการณ์การแยกและการทำงานอัตโนมัติ."
  },
  "examples": {
    "comment_1": "เริ่มต้น {{textParser}} ของคุณด้วยเอกสารนำเข้า",
    "comment_2": "ดึงข้อมูลข้อความทั้งหมดที่มีอยู่จากเอกสาร",
    "comment_3": "หากไม่พบข้อความ ค่าที่ส่งกลับจะเป็น null",
    "comment_4": "รวมเนื้อหาที่ดึงได้ในการแก้ปัญหาของคุณ",
    "comment_5": "รูปแบบนี้อาจไม่สนับสนุนการดึงข้อความ"
  },
  "steps": {
    "title": "วิธีการดึงข้อมูลจาก {{FileFormatCap}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "ในการดึงข้อมูลที่เป็นประโยชน์จากเอกสาร {{FileFormatUp}} ในโครงการ {{EnvName}} ของคุณโดยใช้ [{{ProdShortName}}]({{PlatformLink}}) โปรดปฏิบัติตามคำแนะนำดังนี้:",
      "step_1": "เปิดไฟล์ {{FileFormatUp}} ด้วยวัตถุ {{textParser}}.",
      "step_2": "ใช้ parser เพื่อดึงข้อมูลที่ต้องการ (ข้อความ ตาราง ข้อมูลเมตา ฯลฯ).",
      "step_3": "ตรวจสอบให้แน่ใจว่าผลลัพธ์ถูกต้องและสมบูรณ์.",
      "step_4": "รวมเนื้อหาที่แยกได้ลงในกระบวนการข้อมูล ธุรกิจ หรือแอพพลิเคชั่นของคุณ."
    }
  },
  "more_features": {
    "title": "ฟังก์ชันการแยกเอกสารที่หลากหลาย",
    "description": "{{ProdShortName}} ทำมากกว่าการดึงข้อความ—รองรับการแยกบาร์โค้ด ข้อมูลเมตา รูปภาพ ตาราง และข้อมูลอื่น ๆ เพื่อส่งเสริมการทำงานอัตโนมัติอย่างชาญฉลาดและแอพพลิเคชั่นที่ขับเคลื่อนข้อมูล.",
    "image_description": "ภาพรวมวิสัยทัศน์ของการแยกและการดึงข้อมูลจากเอกสาร",
    "feature_1": {
      "title": "ดึงข้อมูลจากหลายรูปแบบไฟล์",
      "content": "เข้าถึงข้อมูลเช่น ข้อความ ตาราง และสื่อจากประเภทไฟล์ที่ใช้อย่างแพร่หลาย เช่น PDF, Word, Excel, PowerPoint, HTML และอื่น ๆ."
    },
    "feature_2": {
      "title": "แยกเนื้อหาจากแหล่งดิจิทัลและสแกน",
      "content": "ประมวลผลเนื้อหาจากไฟล์ดิจิทัลพื้นฐานและภาพที่สแกน โดยใช้ OCR เมื่อจำเป็นเพื่ออ่านข้อความที่ฝังอยู่."
    },
    "feature_3": {
      "title": "ตัวเลือกการกำหนดค่าที่ยืดหยุ่น",
      "content": "ปรับแต่งการแยกข้อมูลของคุณด้วยการตั้งค่าสำหรับการเลือกหน้า โซนเลย์เอาต์ และแม่แบบฟิลด์กำหนดเองเพื่อตอบสนองความต้องการการดึงเฉพาะ."
    },
    "code_1": {
      "title": "การแยก PDF โดยใช้แม่แบบการดึงข้อมูล",
      "content": "ตัวอย่างนี้แสดงวิธีการดึงฟิลด์ที่มีโครงสร้างจาก PDF โดยใช้แม่แบบกำหนดเองผ่าน {{ProdShortName}}.",
      "comment_1": "เปิด PDF โดยใช้คลาส {{textParser}}",
      "comment_2": "ใช้แม่แบบการแยกเพื่อดึงข้อมูลที่กำหนด",
      "comment_3": "ตรวจสอบว่าการดึงข้อมูลตามแม่แบบพร้อมใช้งานหรือไม่",
      "comment_4": "ทำงานกับฟิลด์ข้อมูลที่แยกได้",
      "comment_5": "กำหนดการตั้งค่าตรวจจับสำหรับการดึงส่วน 'รายละเอียด'"
    }
  }
}