{
  "head": {
    "title": "Извлечение содержания из файлов {{FileFormatUp}} в приложениях {{ProgLang}}",
    "description": "Используйте {{ProdShortName}} для разбора и извлечения структурированных данных, текста, таблиц и изображений из файлов {{FileFormatUp}} в {{ProgLang}}, без необходимости в сторонних инструментах."
  },
  "header": {
    "title": "Извлечение данных из документов {{FileFormatUp}} в {{ProgLang}}",
    "description": "Беспрепятственно извлекайте структурированное содержание, такое как текст, метаданные, таблицы и графику из PDF, Word, Excel и документов на основе изображений, используя {{ProdShortName}} в ваших приложениях {{EnvNameShort}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачать Бесплатную Версию"
  },
  "about": {
    "title": "Что такое {{ProdFullName}}?",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) — это мощное API, созданное для разработчиков {{EnvName}}, предлагающее функции расширенного разбора документов. Оно позволяет извлекать и обрабатывать текстовые данные, изображения, таблицы, структурированные поля и штрих-коды из множества форматов, таких как PDF, DOCX, XLSX, PPTX и других — всё это без установки дополнительных библиотек."
  },
  "formats": {
    "title": "Поддерживаемые форматы файлов для извлечения содержания",
    "description": "{{ProdShortName}} совместимо с широким спектром форматов файлов документов и изображений, что упрощает извлечение информации из часто используемых форматов в сценариях разбора и автоматизации данных."
  },
  "examples": {
    "comment_1": "Инициализируйте ваш {{textParser}} с входным документом",
    "comment_2": "Извлеките все доступные текстовые данные из документа",
    "comment_3": "Если текст не найден, возвращаемое значение будет null",
    "comment_4": "Включите извлечённое содержание в ваше решение",
    "comment_5": "Этот формат может не поддерживать извлечение текста"
  },
  "steps": {
    "title": "Как извлечь данные из {{FileFormatCap}} с помощью {{ProgLang}}",
    "content": {
      "title": "Чтобы извлечь полезную информацию из документов {{FileFormatUp}} в ваших проектах {{EnvName}} с использованием [{{ProdShortName}}]({{PlatformLink}}), выполните следующие шаги:",
      "step_1": "Откройте файл {{FileFormatUp}} с помощью объекта {{textParser}}.",
      "step_2": "Используйте парсер для извлечения необходимых данных (текст, таблицы, метаданные и т.д.).",
      "step_3": "Убедитесь, что вывод правильный и полный.",
      "step_4": "Интегрируйте разобранное содержание в ваши рабочие процессы данных, бизнес-процессы или приложения."
    }
  },
  "more_features": {
    "title": "Универсальные функции разбора документов",
    "description": "{{ProdShortName}} делает больше, чем просто извлечение текста — он поддерживает полный разбор штрих-кодов, метаданных, изображений, таблиц и других данных для создания интеллектуальной автоматизации и приложений, основанных на данных.",
    "image_description": "Визуальный обзор разбора и извлечения данных из документов",
    "feature_1": {
      "title": "Извлечение из нескольких форматов файлов",
      "content": "Доступ к данным, таким как текст, таблицы и медиа, из широко используемых типов файлов, таких как PDF, Word, Excel, PowerPoint, HTML и других."
    },
    "feature_2": {
      "title": "Разбор содержания из цифровых и отсканированных источников",
      "content": "Обработка содержания как из нативных цифровых файлов, так и отсканированных изображений с использованием OCR, когда это необходимо для интерпретации встроенного текста."
    },
    "feature_3": {
      "title": "Гибкие параметры конфигурации",
      "content": "Настраивайте ваш разбор с помощью настроек выбора страниц, зон макета и пользовательских шаблонов полей для удовлетворения специфических потребностей извлечения."
    },
    "code_1": {
      "title": "Разбор PDF с использованием шаблона извлечения данных",
      "content": "Этот пример демонстрирует, как извлечь структурированные поля из PDF с использованием пользовательского шаблона через {{ProdShortName}}.",
      "comment_1": "Откройте PDF с помощью класса {{textParser}}",
      "comment_2": "Примените шаблон разбора для извлечения определенных данных",
      "comment_3": "Проверьте, доступен ли разбор, основанный на шаблонах",
      "comment_4": "Работайте с извлечёнными полями данных",
      "comment_5": "Определите настройки детектора для извлечения раздела 'Детали'"
    }
  }
}