{
  "head": {
    "title": "Витягніть вміст з файлів {{FileFormatUp}} у додатках {{ProgLang}}",
    "description": "Використовуйте {{ProdShortName}} для парсингу та отримання структурованих даних, тексту, таблиць та зображень з файлів {{FileFormatUp}} у {{ProgLang}}, без необхідності у сторонніх інструментах."
  },
  "header": {
    "title": "Витягніть дані з документів {{FileFormatUp}} у {{ProgLang}}",
    "description": "Безшовно витягайте структурований вміст, такий як текст, метадані, таблиці та графіку з PDF, Word, Excel та документів на основі зображень, використовуючи {{ProdShortName}} у ваших додатках {{EnvNameShort}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажити безкоштовну пробну версію"
  },
  "about": {
    "title": "Що таке {{ProdFullName}}?",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) — це потужний API, створений для розробників {{EnvName}}, який пропонує розвинуті функції парсингу документів. Він дозволяє вам витягувати та обробляти текстові дані, зображення, таблиці, структуровані поля та штрих-коди з численних форматів, таких як PDF, DOCX, XLSX, PPTX і більше — все це без установки додаткових бібліотек."
  },
  "formats": {
    "title": "Типи файлів, що підтримуються для витягнення вмісту",
    "description": "{{ProdShortName}} сумісний з широким спектром документів та типів файлів зображень, що дозволяє легко витягувати інформацію з широко використовуваних форматів у сценаріях парсингу та автоматизації даних."
  },
  "examples": {
    "comment_1": "Ініціалізуйте ваш {{textParser}} з вхідним документом",
    "comment_2": "Отримайте всі доступні текстові вмісти з документа",
    "comment_3": "Якщо текст не знайдено, то повернене значення буде null",
    "comment_4": "Включіть витягнутий вміст у ваше рішення",
    "comment_5": "Цей формат може не підтримувати витягнення тексту"
  },
  "steps": {
    "title": "Як витягнути дані з {{FileFormatCap}} за допомогою {{ProgLang}}",
    "content": {
      "title": "Щоб витягти корисну інформацію з документів {{FileFormatUp}} у ваших проектах {{EnvName}} за допомогою [{{ProdShortName}}]({{PlatformLink}}), дотримуйтесь цих інструкцій:",
      "step_1": "Відкрийте файл {{FileFormatUp}} за допомогою об'єкта {{textParser}}.",
      "step_2": "Використовуйте парсер для отримання необхідних даних (текст, таблиці, метадані тощо).",
      "step_3": "Перевірте, чи є результати коректними та повними.",
      "step_4": "Інтегруйте витягнутий вміст у ваші бізнес-процеси, потоки даних або додатки."
    }
  },
  "more_features": {
    "title": "Універсальні функції парсингу документів",
    "description": "{{ProdShortName}} робить більше, ніж просто витягнення тексту — він підтримує повний парсинг штрих-кодів, метаданих, зображень, таблиць та інших даних для забезпечення розумної автоматизації та додатків, орієнтованих на дані.",
    "image_description": "Візуальний огляд парсингу та витягнення даних з документів",
    "feature_1": {
      "title": "Витягуйте з кількох форматів файлів",
      "content": "Отримуйте дані, такі як текст, таблиці та медіа з широко використовуваних типів файлів, таких як PDF, Word, Excel, PowerPoint, HTML та інші."
    },
    "feature_2": {
      "title": "Парсинг вмісту з цифрових та сканованих джерел",
      "content": "Обробляйте вміст як з нативних цифрових файлів, так і зі сканованих зображень, використовуючи OCR, коли це необхідно для розпізнавання вбудованого тексту."
    },
    "feature_3": {
      "title": "Гнучкі параметри конфігурації",
      "content": "Налаштуйте свій парсинг, використовуючи параметри для вибору сторінок, зон макета та шаблонів полів для конкретних потреб витягнення."
    },
    "code_1": {
      "title": "Парсинг PDF з використанням шаблону витягнення даних",
      "content": "цей приклад демонструє, як витягнути структуровані поля з PDF, використовуючи спеціальний шаблон через {{ProdShortName}}.",
      "comment_1": "Відкрийте PDF за допомогою класу {{textParser}}",
      "comment_2": "Застосуйте шаблон парсингу для витягнення визначених даних",
      "comment_3": "Переконайтеся, що витягнення на основі шаблону доступне",
      "comment_4": "Працюйте з витягнутими полями даних",
      "comment_5": "Визначте налаштування детектора для витягнення розділу 'Деталі'"
    }
  }
}