{
  "head": {
    "title": "Trích xuất nội dung từ các tệp {{FileFormatUp}} trong ứng dụng {{ProgLang}}",
    "description": "Sử dụng {{ProdShortName}} để phân tích và lấy dữ liệu có cấu trúc, văn bản, bảng biểu, và hình ảnh từ các tệp {{FileFormatUp}} trong {{ProgLang}}, mà không cần công cụ bên ngoài."
  },
  "header": {
    "title": "Trích xuất dữ liệu từ tài liệu {{FileFormatUp}} trong {{ProgLang}}",
    "description": "Trích xuất nội dung có cấu trúc như văn bản, siêu dữ liệu, bảng biểu và đồ họa từ tài liệu PDF, Word, Excel và tài liệu dựa trên hình ảnh bằng cách sử dụng {{ProdShortName}} trong các ứng dụng {{EnvNameShort}} của bạn.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Tải xuống Phiên bản Dùng Thử Miễn Phí"
  },
  "about": {
    "title": "{{ProdFullName}} là gì?",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) là một API mạnh mẽ được xây dựng cho các nhà phát triển {{EnvName}}, cung cấp chức năng phân tích tài liệu tiên tiến. Nó cho phép bạn trích xuất và xử lý dữ liệu văn bản, hình ảnh, bảng biểu, trường có cấu trúc và mã vạch từ nhiều định dạng như PDF, DOCX, XLSX, PPTX và nhiều hơn nữa — tất cả mà không cần cài đặt thêm thư viện."
  },
  "formats": {
    "title": "Các loại tệp hỗ trợ trích xuất nội dung",
    "description": "{{ProdShortName}} tương thích với nhiều loại tệp tài liệu và hình ảnh, giúp bạn trích xuất thông tin từ các định dạng thường được sử dụng trong các kịch bản phân tích và tự động hóa dữ liệu."
  },
  "examples": {
    "comment_1": "Khởi tạo {{textParser}} của bạn với tài liệu đầu vào",
    "comment_2": "Lấy tất cả nội dung văn bản có sẵn từ tài liệu",
    "comment_3": "Nếu không tìm thấy văn bản, giá trị trả về sẽ là null",
    "comment_4": "Kết hợp nội dung đã trích xuất vào giải pháp của bạn",
    "comment_5": "Định dạng này có thể không hỗ trợ trích xuất văn bản"
  },
  "steps": {
    "title": "Cách trích xuất dữ liệu từ {{FileFormatCap}} bằng {{ProgLang}}",
    "content": {
      "title": "Để trích xuất thông tin hữu ích từ các tài liệu {{FileFormatUp}} trong dự án {{EnvName}} của bạn bằng [{{ProdShortName}}]({{PlatformLink}}), hãy làm theo các hướng dẫn sau:",
      "step_1": "Mở tệp {{FileFormatUp}} với đối tượng {{textParser}}.",
      "step_2": "Sử dụng bộ phân tích để lấy dữ liệu cần thiết (văn bản, bảng, siêu dữ liệu, v.v.).",
      "step_3": "Đảm bảo đầu ra là đúng và đầy đủ.",
      "step_4": "Tích hợp nội dung đã phân tích vào quy trình dữ liệu, quy trình kinh doanh hoặc ứng dụng của bạn."
    }
  },
  "more_features": {
    "title": "Chức năng phân tích tài liệu đa dạng",
    "description": "{{ProdShortName}} không chỉ dừng lại ở việc trích xuất văn bản—nó hỗ trợ phân tích đầy đủ mã vạch, siêu dữ liệu, hình ảnh, bảng biểu và các dữ liệu khác để thúc đẩy tự động hóa thông minh và các ứng dụng dựa trên dữ liệu.",
    "image_description": "Tổng quan trực quan về phân tích và trích xuất dữ liệu tài liệu",
    "feature_1": {
      "title": "Trích xuất từ nhiều định dạng tệp",
      "content": "Truy cập dữ liệu như văn bản, bảng biểu và phương tiện từ các loại tệp được sử dụng rộng rãi như PDF, Word, Excel, PowerPoint, HTML và nhiều loại khác."
    },
    "feature_2": {
      "title": "Phân tích nội dung từ các nguồn kỹ thuật số và đã quét",
      "content": "Xử lý nội dung từ cả các tệp kỹ thuật số gốc và hình ảnh đã quét, sử dụng OCR khi cần thiết để giải mã văn bản nhúng."
    },
    "feature_3": {
      "title": "Tùy chọn cấu hình linh hoạt",
      "content": "Tùy chỉnh việc phân tích của bạn với các thiết lập cho lựa chọn trang, khu vực bố trí và mẫu trường tùy chỉnh để đáp ứng các nhu cầu trích xuất cụ thể."
    },
    "code_1": {
      "title": "Phân tích PDF bằng mẫu trích xuất dữ liệu",
      "content": "Mẫu này cho thấy cách trích xuất các trường có cấu trúc từ một tệp PDF bằng cách sử dụng một mẫu tùy chỉnh qua {{ProdShortName}}.",
      "comment_1": "Mở PDF bằng lớp {{textParser}}",
      "comment_2": "Áp dụng mẫu phân tích để trích xuất dữ liệu đã định nghĩa",
      "comment_3": "Kiểm tra xem việc trích xuất dựa trên mẫu có khả dụng hay không",
      "comment_4": "Làm việc với các trường dữ liệu đã trích xuất",
      "comment_5": "Định nghĩa cài đặt phát hiện để trích xuất phần 'Chi tiết'"
    }
  }
}