{
  "head": {
    "title": "ดึงลิงก์จากไฟล์ {{FileFormatUp}} ในแอป {{ProgLang}}",
    "description": "ใช้ {{ProdShortName}} เพื่อค้นหาและดึงลิงก์จากไฟล์ {{FileFormatUp}} ใน {{ProgLang}} โดยไม่ต้องใช้เครื่องมือหรือซอฟต์แวร์เพิ่มเติม."
  },
  "header": {
    "title": "ดึงลิงก์จาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ค้นหาและดึง URL และลิงก์จาก PDF, Word, Excel และประเภทเอกสารอื่น ๆ โดยใช้ {{ProdShortName}} ในแอปพลิเคชัน {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API {{ProdFullName}}",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) เป็น API การวิเคราะห์เอกสารที่หลากหลายสำหรับนักพัฒนาที่ใช้ {{EnvName}} รองรับการดึงลิงก์, ข้อความ, รูปภาพ และเนื้อหาที่มีโครงสร้างจากหลายรูปแบบไฟล์ เช่น PDF, Word, Excel, HTML และอื่น ๆ — โดยไม่ต้องพึ่งพาซอฟต์แวร์ของบุคคลที่สาม."
  },
  "formats": {
    "title": "รูปแบบที่รองรับในการดึงลิงก์",
    "description": "{{ProdShortName}} สามารถดึงลิงก์จากประเภทเอกสารที่หลากหลาย ดูด้านล่างสำหรับรูปแบบที่มักจะรองรับ."
  },
  "examples": {
    "comment_1": "โหลดเอกสารที่มีลิงก์โดยใช้คลาส {{textParser}}",
    "comment_2": "ตรวจสอบว่าไฟล์สนับสนุนการดึงลิงก์",
    "comment_3": "การดึงลิงก์ไม่สามารถใช้ได้กับไฟล์นี้",
    "comment_4": "ดึงข้อมูลลิงก์ที่ถูกดึงออกมาและประมวลผล"
  },
  "steps": {
    "title": "ขั้นตอนในการดึงลิงก์จาก {{FileFormatCap}} ใน {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้นักพัฒนาที่ใช้ {{EnvName}} ดึงลิงก์จากไฟล์ {{FileFormatUp}} โดยปฏิบัติตามขั้นตอนง่าย ๆ เหล่านี้:",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} โดยใช้อินสแตนซ์ {{textParser}}.",
      "step_2": "ตรวจสอบว่าเอกสารรองรับการดึงลิงก์.",
      "step_3": "ดึงรายการลิงก์จากเอกสาร.",
      "step_4": "วนซากผลลัพธ์และทำงานกับ URL ที่ดึงออกมา."
    }
  },
  "more_features": {
    "title": "ความสามารถในการวิเคราะห์เอกสารขั้นสูง",
    "description": "นอกเหนือจากการดึงลิงก์ {{ProdShortName}} ยังช่วยให้คุณสามารถดึงข้อความ, ข้อมูลเมตา, รูปภาพ และข้อมูลที่มีโครงสร้าง — รองรับการประมวลผลข้อมูลที่มีประสิทธิภาพ.",
    "image_description": "การตรวจจับลิงก์และการวิเคราะห์เอกสาร",
    "feature_1": {
      "title": "การตรวจจับลิงก์จากเอกสาร",
      "content": "ดึง URL และคำอธิบายลิงก์จากเอกสารประเภท PDF, ไฟล์ Word, สเปรดชีต และอื่น ๆ ได้อย่างรวดเร็ว."
    },
    "feature_2": {
      "title": "รองรับลิงก์เว็บและลิงก์ภายใน",
      "content": "ตรวจจับและดึงทั้ง URL เว็บปกติและลิงก์ภายในเอกสารจากรูปแบบหลาย ๆ รูปแบบ."
    },
    "feature_3": {
      "title": "ตัวเลือกการวิเคราะห์ที่ยืดหยุ่น",
      "content": "ปรับแต่งการตั้งค่าการดึงข้อมูลเพื่อสแกนส่วนหรือหน้าที่เฉพาะเพื่อปรับปรุงประสิทธิภาพและความแม่นยำ."
    },
    "code_1": {
      "title": "วิธีดึงลิงก์จาก PDF โดยใช้ตัวเลือกลิงก์",
      "content": "นี่คือตัวอย่างโค้ดที่แสดงวิธีดึงลิงก์ทั้งหมดจากไฟล์ PDF โดยใช้ตัวเลือกที่กำหนดเอง.",
      "comment_1": "เริ่มต้น {{textParser}} ด้วยเอกสาร PDF",
      "comment_2": "ตรวจสอบว่าการดึงลิงก์ได้รับการสนับสนุน",
      "comment_3": "ตั้งค่าตัวเลือกการดึงลิงก์เพื่อลดขอบเขตผลลัพธ์",
      "comment_4": "ดึงข้อมูลลิงก์จากเอกสาร",
      "comment_5": "จัดการกับรายการลิงก์ที่ถูกดึงออกมา"
    }
  }
}