{
  "head": {
    "title": "ดึงลิงก์ใช้งานจากไฟล์ {{FileFormatUp}} ในแอพ {{ProgLang}}",
    "description": "ใช้ {{ProdShortName}} เพื่อค้นหาและดึงลิงก์ URL จากเอกสาร {{FileFormatUp}} ในโปรเจค {{ProgLang}}—ไม่ต้องใช้ซอฟต์แวร์เพิ่มเติม."
  },
  "header": {
    "title": "ดึงลิงก์ใช้งานจาก {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ดึงลิงก์เว็บและลิงก์ใช้งานออกจากไฟล์ PDF, เอกสาร Word, แผ่น Excel และเอกสารอื่น ๆ โดยใช้ {{ProdShortName}} ในสภาพแวดล้อม {{EnvNameShort}} ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดเวอร์ชันทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API {{ProdFullName}}",
    "content": "[{{ProdShortName}}]({{PlatformLink}}) เป็น API การดึงข้อมูลที่มีประสิทธิภาพ ออกแบบมาสำหรับนักพัฒนา {{EnvName}} มันมีเครื่องมือสำหรับการดึงลิงก์ใช้งาน, ข้อมูลที่มีโครงสร้าง, รูปภาพ, และข้อความจากรูปแบบที่นิยมเช่น DOCX, XLSX, PDF, HTML และอื่น ๆ — ทั้งหมดนี้ไม่ต้องใช้ปลั๊กอินภายนอก."
  },
  "formats": {
    "title": "รูปแบบเอกสารที่รองรับการดึงลิงก์ใช้งาน",
    "description": "ด้วย {{ProdShortName}}, คุณสามารถดึงลิงก์ใช้งานจากหลายรูปแบบไฟล์ที่ใช้อย่างแพร่หลาย ด้านล่างเป็นรายการรูปแบบที่มักจะรองรับ."
  },
  "examples": {
    "comment_1": "โหลดไฟล์ที่อาจมีลิงก์ใช้งานโดยใช้ {{textParser}}",
    "comment_2": "ตรวจสอบว่าเอกสารรูปแบบสนับสนุนการวิเคราะห์ลิงก์ใช้งานหรือไม่",
    "comment_3": "การดึงลิงก์ใช้งานไม่สามารถใช้ได้กับไฟล์นี้",
    "comment_4": "ดึงและใช้ข้อมูลลิงก์ใช้งานจากเอกสาร"
  },
  "steps": {
    "title": "วิธีการดึงลิงก์ใช้งานจาก {{FileFormatCap}} ใน {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ทำให้การดึงลิงก์ใช้งานจากไฟล์ {{FileFormatUp}} ในแอพ {{EnvName}} เป็นเรื่องง่ายด้วยขั้นตอนเหล่านี้:",
      "step_1": "เปิดไฟล์ {{FileFormatUp}} โดยใช้ตัวอย่างของ {{textParser}}.",
      "step_2": "ตรวจสอบว่าการดึงลิงก์ใช้งานสามารถใช้ได้กับรูปแบบไฟล์นี้.",
      "step_3": "ดึงลิงก์ใช้งานทั้งหมดโดยใช้วิธีที่เหมาะสม.",
      "step_4": "วนรอบผลลัพธ์และประมวลผลแต่ละลิงก์ตามที่ต้องการ."
    }
  },
  "more_features": {
    "title": "เครื่องมือการวิเคราะห์เอกสารที่ครอบคลุม",
    "description": "นอกเหนือจากการดึงลิงก์ใช้งาน, {{ProdShortName}} ยังช่วยให้คุณสามารถรวบรวมเนื้อหาที่มีประโยชน์อื่น ๆ เช่น ข้อความธรรมดา, สื่อที่ฝังตัว, และข้อมูลที่มีโครงสร้างสำหรับใช้ในเวิร์กโฟลว์อัตโนมัติ.",
    "image_description": "การดึงลิงก์ใช้งานและการวิเคราะห์เอกสาร",
    "feature_1": {
      "title": "การตรวจจับลิงก์ที่แม่นยำ",
      "content": "จับลิงก์ใช้งานทุกประเภทจากเลย์เอาต์เอกสารที่แตกต่างกัน รวมถึงข้อความที่สามารถคลิกได้และ URL ที่ซ่อนอยู่."
    },
    "feature_2": {
      "title": "ทำงานกับเอกสารและเนื้อหาเว็บ",
      "content": "ดึงลิงก์จากไฟล์ PDF, DOCX, XLSX, HTML, และไฟล์ภาพที่มีลิงก์ใช้งานฝังอยู่."
    },
    "feature_3": {
      "title": "พฤติกรรมการดึงข้อมูลที่ปรับแต่งได้",
      "content": "ปรับปรุงวิธีที่ลิงก์ใช้งานถูกดึงออกโดยใช้ตัวเลือกเช่น ระยะหน้า, ประเภทลิงก์, หรือการกรองเนื้อหา."
    },
    "code_1": {
      "title": "ตัวอย่าง: การดึงลิงก์ใช้งานจาก PDF ด้วยตัวเลือกที่ปรับแต่ง",
      "content": "ตัวอย่างนี้แสดงวิธีการดึงลิงก์ทั้งหมดจากไฟล์ PDF โดยใช้การตั้งค่าการดึงลิงก์.",
      "comment_1": "เปิด PDF โดยใช้คลาส {{textParser}}",
      "comment_2": "ตรวจสอบว่าการสนับสนุนลิงก์ใช้งานเปิดใช้งานสำหรับเอกสารนี้หรือไม่",
      "comment_3": "ใช้ตัวเลือกเพื่อต filtr ลิงก์",
      "comment_4": "ใช้ parser เพื่อรับข้อมูลลิงก์ใช้งาน",
      "comment_5": "วนรอบลิงก์และจัดการตามความเหมาะสม"
    }
  }
}